{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "zeropadding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_1", "trainable": true, "padding": [2, 2]}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "conv1", "class_name": "Convolution2D", "config": {"name": "conv1", "trainable": true, "nb_filter": 32, "nb_row": 2, "nb_col": 2, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["conv1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [3, 3], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "dropout1", "class_name": "Dropout", "config": {"name": "dropout1", "trainable": true, "p": 0.2}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "res1a_branch2a", "class_name": "Convolution2D", "config": {"name": "res1a_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["dropout1", 0, 0]]]}, {"name": "bn1a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res1a_branch2a", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1a_branch2a", 0, 0]]]}, {"name": "res1a_branch2b", "class_name": "Convolution2D", "config": {"name": "res1a_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "bn1a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res1a_branch2b", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1a_branch2b", 0, 0]]]}, {"name": "res1a_branch2c", "class_name": "Convolution2D", "config": {"name": "res1a_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "res1a_branch1", "class_name": "Convolution2D", "config": {"name": "res1a_branch1", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["dropout1", 0, 0]]]}, {"name": "bn1a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res1a_branch2c", 0, 0]]]}, {"name": "bn1a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn1a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res1a_branch1", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn1a_branch2c", 0, 0], ["bn1a_branch1", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "res1b_branch2a", "class_name": "Convolution2D", "config": {"name": "res1b_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "bn1b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1b_branch2a", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1b_branch2a", 0, 0]]]}, {"name": "res1b_branch2b", "class_name": "Convolution2D", "config": {"name": "res1b_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "bn1b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1b_branch2b", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1b_branch2b", 0, 0]]]}, {"name": "res1b_branch2c", "class_name": "Convolution2D", "config": {"name": "res1b_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "bn1b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1b_branch2c", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn1b_branch2c", 0, 0], ["activation_4", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "res1c_branch2a", "class_name": "Convolution2D", "config": {"name": "res1c_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "bn1c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1c_branch2a", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1c_branch2a", 0, 0]]]}, {"name": "res1c_branch2b", "class_name": "Convolution2D", "config": {"name": "res1c_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "bn1c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1c_branch2b", 0, 0]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn1c_branch2b", 0, 0]]]}, {"name": "res1c_branch2c", "class_name": "Convolution2D", "config": {"name": "res1c_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"name": "bn1c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn1c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res1c_branch2c", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn1c_branch2c", 0, 0], ["activation_7", 0, 0]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "res2a_branch2a", "class_name": "Convolution2D", "config": {"name": "res2a_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res2a_branch2a", 0, 0]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0]]]}, {"name": "res2a_branch2b", "class_name": "Convolution2D", "config": {"name": "res2a_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res2a_branch2b", 0, 0]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0]]]}, {"name": "res2a_branch2c", "class_name": "Convolution2D", "config": {"name": "res2a_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"name": "res2a_branch1", "class_name": "Convolution2D", "config": {"name": "res2a_branch1", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res2a_branch2c", 0, 0]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res2a_branch1", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "res2b_branch2a", "class_name": "Convolution2D", "config": {"name": "res2b_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2b_branch2a", 0, 0]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0]]]}, {"name": "res2b_branch2b", "class_name": "Convolution2D", "config": {"name": "res2b_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2b_branch2b", 0, 0]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0]]]}, {"name": "res2b_branch2c", "class_name": "Convolution2D", "config": {"name": "res2b_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2b_branch2c", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_13", 0, 0]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "res2c_branch2a", "class_name": "Convolution2D", "config": {"name": "res2c_branch2a", "trainable": true, "nb_filter": 32, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2c_branch2a", 0, 0]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0]]]}, {"name": "res2c_branch2b", "class_name": "Convolution2D", "config": {"name": "res2c_branch2b", "trainable": true, "nb_filter": 32, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2c_branch2b", 0, 0]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0]]]}, {"name": "res2c_branch2c", "class_name": "Convolution2D", "config": {"name": "res2c_branch2c", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res2c_branch2c", 0, 0]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_16", 0, 0]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"name": "res3a_branch2a", "class_name": "Convolution2D", "config": {"name": "res3a_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res3a_branch2a", 0, 0]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0]]]}, {"name": "res3a_branch2b", "class_name": "Convolution2D", "config": {"name": "res3a_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res3a_branch2b", 0, 0]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0]]]}, {"name": "res3a_branch2c", "class_name": "Convolution2D", "config": {"name": "res3a_branch2c", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_21", 0, 0]]]}, {"name": "res3a_branch1", "class_name": "Convolution2D", "config": {"name": "res3a_branch1", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res3a_branch2c", 0, 0]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.6}, "inbound_nodes": [[["res3a_branch1", 0, 0]]]}, {"name": "merge_7", "class_name": "Merge", "config": {"name": "merge_7", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"name": "res3b_branch2a", "class_name": "Convolution2D", "config": {"name": "res3b_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_22", 0, 0]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3b_branch2a", 0, 0]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0]]]}, {"name": "res3b_branch2b", "class_name": "Convolution2D", "config": {"name": "res3b_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_23", 0, 0]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3b_branch2b", 0, 0]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0]]]}, {"name": "res3b_branch2c", "class_name": "Convolution2D", "config": {"name": "res3b_branch2c", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_24", 0, 0]]]}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3b_branch2c", 0, 0]]]}, {"name": "merge_8", "class_name": "Merge", "config": {"name": "merge_8", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_22", 0, 0]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"name": "res3c_branch2a", "class_name": "Convolution2D", "config": {"name": "res3c_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_25", 0, 0]]]}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3c_branch2a", 0, 0]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0]]]}, {"name": "res3c_branch2b", "class_name": "Convolution2D", "config": {"name": "res3c_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_26", 0, 0]]]}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3c_branch2b", 0, 0]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0]]]}, {"name": "res3c_branch2c", "class_name": "Convolution2D", "config": {"name": "res3c_branch2c", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_27", 0, 0]]]}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3c_branch2c", 0, 0]]]}, {"name": "merge_9", "class_name": "Merge", "config": {"name": "merge_9", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_25", 0, 0]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_9", 0, 0]]]}, {"name": "res3d_branch2a", "class_name": "Convolution2D", "config": {"name": "res3d_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_28", 0, 0]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3d_branch2a", 0, 0]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0]]]}, {"name": "res3d_branch2b", "class_name": "Convolution2D", "config": {"name": "res3d_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_29", 0, 0]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3d_branch2b", 0, 0]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0]]]}, {"name": "res3d_branch2c", "class_name": "Convolution2D", "config": {"name": "res3d_branch2c", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_30", 0, 0]]]}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.9}, "inbound_nodes": [[["res3d_branch2c", 0, 0]]]}, {"name": "merge_10", "class_name": "Merge", "config": {"name": "merge_10", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_28", 0, 0]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_10", 0, 0]]]}, {"name": "avg_pool", "class_name": "AveragePooling2D", "config": {"name": "avg_pool", "trainable": true, "pool_size": [4, 4], "border_mode": "valid", "strides": [4, 4], "dim_ordering": "th"}, "inbound_nodes": [[["activation_31", 0, 0]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["avg_pool", 0, 0]]]}, {"name": "drop-flat", "class_name": "Dropout", "config": {"name": "drop-flat", "trainable": true, "p": 0.5}, "inbound_nodes": [[["flatten_1", 0, 0]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "output_dim": 512, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1152}, "inbound_nodes": [[["drop-flat", 0, 0]]]}, {"name": "drop-d1-1", "class_name": "Dropout", "config": {"name": "drop-d1-1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["dense1", 0, 0]]]}, {"name": "finir", "class_name": "Dense", "config": {"name": "finir", "trainable": true, "output_dim": 14, "init": "glorot_uniform", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}, "inbound_nodes": [[["drop-d1-1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["finir", 0, 0]]}, "keras_version": "1.2.2"}