{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "zeropadding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zeropadding2d_1", "trainable": true, "padding": [3, 3]}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "conv1", "class_name": "Convolution2D", "config": {"name": "conv1", "trainable": true, "nb_filter": 64, "nb_row": 7, "nb_col": 7, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["zeropadding2d_1", 0, 0]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["conv1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0]]]}, {"name": "maxpooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [3, 3], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "res2a_branch2a", "class_name": "Convolution2D", "config": {"name": "res2a_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2a_branch2a", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0]]]}, {"name": "res2a_branch2b", "class_name": "Convolution2D", "config": {"name": "res2a_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2a_branch2b", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0]]]}, {"name": "res2a_branch2c", "class_name": "Convolution2D", "config": {"name": "res2a_branch2c", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "res2a_branch1", "class_name": "Convolution2D", "config": {"name": "res2a_branch1", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2a_branch2c", 0, 0]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2a_branch1", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2a_branch2c", 0, 0], ["bn2a_branch1", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "res2b_branch2a", "class_name": "Convolution2D", "config": {"name": "res2b_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2b_branch2a", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2a", 0, 0]]]}, {"name": "res2b_branch2b", "class_name": "Convolution2D", "config": {"name": "res2b_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2b_branch2b", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2b_branch2b", 0, 0]]]}, {"name": "res2b_branch2c", "class_name": "Convolution2D", "config": {"name": "res2b_branch2c", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2b_branch2c", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2b_branch2c", 0, 0], ["activation_4", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "res2c_branch2a", "class_name": "Convolution2D", "config": {"name": "res2c_branch2a", "trainable": true, "nb_filter": 64, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2c_branch2a", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2a", 0, 0]]]}, {"name": "res2c_branch2b", "class_name": "Convolution2D", "config": {"name": "res2c_branch2b", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2c_branch2b", 0, 0]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn2c_branch2b", 0, 0]]]}, {"name": "res2c_branch2c", "class_name": "Convolution2D", "config": {"name": "res2c_branch2c", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn2c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res2c_branch2c", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn2c_branch2c", 0, 0], ["activation_7", 0, 0]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "res3a_branch2a", "class_name": "Convolution2D", "config": {"name": "res3a_branch2a", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3a_branch2a", 0, 0]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0]]]}, {"name": "res3a_branch2b", "class_name": "Convolution2D", "config": {"name": "res3a_branch2b", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3a_branch2b", 0, 0]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0]]]}, {"name": "res3a_branch2c", "class_name": "Convolution2D", "config": {"name": "res3a_branch2c", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"name": "res3a_branch1", "class_name": "Convolution2D", "config": {"name": "res3a_branch1", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3a_branch2c", 0, 0]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3a_branch1", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3a_branch2c", 0, 0], ["bn3a_branch1", 0, 0]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "res3b_branch2a", "class_name": "Convolution2D", "config": {"name": "res3b_branch2a", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3b_branch2a", 0, 0]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2a", 0, 0]]]}, {"name": "res3b_branch2b", "class_name": "Convolution2D", "config": {"name": "res3b_branch2b", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3b_branch2b", 0, 0]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3b_branch2b", 0, 0]]]}, {"name": "res3b_branch2c", "class_name": "Convolution2D", "config": {"name": "res3b_branch2c", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3b_branch2c", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3b_branch2c", 0, 0], ["activation_13", 0, 0]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "res3c_branch2a", "class_name": "Convolution2D", "config": {"name": "res3c_branch2a", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3c_branch2a", 0, 0]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2a", 0, 0]]]}, {"name": "res3c_branch2b", "class_name": "Convolution2D", "config": {"name": "res3c_branch2b", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3c_branch2b", 0, 0]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3c_branch2b", 0, 0]]]}, {"name": "res3c_branch2c", "class_name": "Convolution2D", "config": {"name": "res3c_branch2c", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3c_branch2c", 0, 0]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3c_branch2c", 0, 0], ["activation_16", 0, 0]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"name": "res3d_branch2a", "class_name": "Convolution2D", "config": {"name": "res3d_branch2a", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3d_branch2a", 0, 0]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2a", 0, 0]]]}, {"name": "res3d_branch2b", "class_name": "Convolution2D", "config": {"name": "res3d_branch2b", "trainable": true, "nb_filter": 128, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3d_branch2b", 0, 0]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn3d_branch2b", 0, 0]]]}, {"name": "res3d_branch2c", "class_name": "Convolution2D", "config": {"name": "res3d_branch2c", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_21", 0, 0]]]}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn3d_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res3d_branch2c", 0, 0]]]}, {"name": "merge_7", "class_name": "Merge", "config": {"name": "merge_7", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn3d_branch2c", 0, 0], ["activation_19", 0, 0]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"name": "res4a_branch2a", "class_name": "Convolution2D", "config": {"name": "res4a_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_22", 0, 0]]]}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4a_branch2a", 0, 0]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0]]]}, {"name": "res4a_branch2b", "class_name": "Convolution2D", "config": {"name": "res4a_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_23", 0, 0]]]}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4a_branch2b", 0, 0]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0]]]}, {"name": "res4a_branch2c", "class_name": "Convolution2D", "config": {"name": "res4a_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_24", 0, 0]]]}, {"name": "res4a_branch1", "class_name": "Convolution2D", "config": {"name": "res4a_branch1", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_22", 0, 0]]]}, {"name": "bn4a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4a_branch2c", 0, 0]]]}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4a_branch1", 0, 0]]]}, {"name": "merge_8", "class_name": "Merge", "config": {"name": "merge_8", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4a_branch2c", 0, 0], ["bn4a_branch1", 0, 0]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"name": "res4b_branch2a", "class_name": "Convolution2D", "config": {"name": "res4b_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_25", 0, 0]]]}, {"name": "bn4b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4b_branch2a", 0, 0]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2a", 0, 0]]]}, {"name": "res4b_branch2b", "class_name": "Convolution2D", "config": {"name": "res4b_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_26", 0, 0]]]}, {"name": "bn4b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4b_branch2b", 0, 0]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4b_branch2b", 0, 0]]]}, {"name": "res4b_branch2c", "class_name": "Convolution2D", "config": {"name": "res4b_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_27", 0, 0]]]}, {"name": "bn4b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4b_branch2c", 0, 0]]]}, {"name": "merge_9", "class_name": "Merge", "config": {"name": "merge_9", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4b_branch2c", 0, 0], ["activation_25", 0, 0]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_9", 0, 0]]]}, {"name": "res4c_branch2a", "class_name": "Convolution2D", "config": {"name": "res4c_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_28", 0, 0]]]}, {"name": "bn4c_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4c_branch2a", 0, 0]]]}, {"name": "activation_29", "class_name": "Activation", "config": {"name": "activation_29", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2a", 0, 0]]]}, {"name": "res4c_branch2b", "class_name": "Convolution2D", "config": {"name": "res4c_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_29", 0, 0]]]}, {"name": "bn4c_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4c_branch2b", 0, 0]]]}, {"name": "activation_30", "class_name": "Activation", "config": {"name": "activation_30", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4c_branch2b", 0, 0]]]}, {"name": "res4c_branch2c", "class_name": "Convolution2D", "config": {"name": "res4c_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_30", 0, 0]]]}, {"name": "bn4c_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4c_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4c_branch2c", 0, 0]]]}, {"name": "merge_10", "class_name": "Merge", "config": {"name": "merge_10", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4c_branch2c", 0, 0], ["activation_28", 0, 0]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_10", 0, 0]]]}, {"name": "res4d_branch2a", "class_name": "Convolution2D", "config": {"name": "res4d_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_31", 0, 0]]]}, {"name": "bn4d_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4d_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4d_branch2a", 0, 0]]]}, {"name": "activation_32", "class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4d_branch2a", 0, 0]]]}, {"name": "res4d_branch2b", "class_name": "Convolution2D", "config": {"name": "res4d_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_32", 0, 0]]]}, {"name": "bn4d_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4d_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4d_branch2b", 0, 0]]]}, {"name": "activation_33", "class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4d_branch2b", 0, 0]]]}, {"name": "res4d_branch2c", "class_name": "Convolution2D", "config": {"name": "res4d_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_33", 0, 0]]]}, {"name": "bn4d_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4d_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4d_branch2c", 0, 0]]]}, {"name": "merge_11", "class_name": "Merge", "config": {"name": "merge_11", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4d_branch2c", 0, 0], ["activation_31", 0, 0]]]}, {"name": "activation_34", "class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_11", 0, 0]]]}, {"name": "res4e_branch2a", "class_name": "Convolution2D", "config": {"name": "res4e_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_34", 0, 0]]]}, {"name": "bn4e_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4e_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4e_branch2a", 0, 0]]]}, {"name": "activation_35", "class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4e_branch2a", 0, 0]]]}, {"name": "res4e_branch2b", "class_name": "Convolution2D", "config": {"name": "res4e_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_35", 0, 0]]]}, {"name": "bn4e_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4e_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4e_branch2b", 0, 0]]]}, {"name": "activation_36", "class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4e_branch2b", 0, 0]]]}, {"name": "res4e_branch2c", "class_name": "Convolution2D", "config": {"name": "res4e_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_36", 0, 0]]]}, {"name": "bn4e_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4e_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4e_branch2c", 0, 0]]]}, {"name": "merge_12", "class_name": "Merge", "config": {"name": "merge_12", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4e_branch2c", 0, 0], ["activation_34", 0, 0]]]}, {"name": "activation_37", "class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_12", 0, 0]]]}, {"name": "res4f_branch2a", "class_name": "Convolution2D", "config": {"name": "res4f_branch2a", "trainable": true, "nb_filter": 256, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_37", 0, 0]]]}, {"name": "bn4f_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4f_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4f_branch2a", 0, 0]]]}, {"name": "activation_38", "class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4f_branch2a", 0, 0]]]}, {"name": "res4f_branch2b", "class_name": "Convolution2D", "config": {"name": "res4f_branch2b", "trainable": true, "nb_filter": 256, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_38", 0, 0]]]}, {"name": "bn4f_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4f_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4f_branch2b", 0, 0]]]}, {"name": "activation_39", "class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn4f_branch2b", 0, 0]]]}, {"name": "res4f_branch2c", "class_name": "Convolution2D", "config": {"name": "res4f_branch2c", "trainable": true, "nb_filter": 1024, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_39", 0, 0]]]}, {"name": "bn4f_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn4f_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res4f_branch2c", 0, 0]]]}, {"name": "merge_13", "class_name": "Merge", "config": {"name": "merge_13", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn4f_branch2c", 0, 0], ["activation_37", 0, 0]]]}, {"name": "activation_40", "class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_13", 0, 0]]]}, {"name": "res5a_branch2a", "class_name": "Convolution2D", "config": {"name": "res5a_branch2a", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_40", 0, 0]]]}, {"name": "bn5a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5a_branch2a", 0, 0]]]}, {"name": "activation_41", "class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0]]]}, {"name": "res5a_branch2b", "class_name": "Convolution2D", "config": {"name": "res5a_branch2b", "trainable": true, "nb_filter": 512, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_41", 0, 0]]]}, {"name": "bn5a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5a_branch2b", 0, 0]]]}, {"name": "activation_42", "class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0]]]}, {"name": "res5a_branch2c", "class_name": "Convolution2D", "config": {"name": "res5a_branch2c", "trainable": true, "nb_filter": 2048, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_42", 0, 0]]]}, {"name": "res5a_branch1", "class_name": "Convolution2D", "config": {"name": "res5a_branch1", "trainable": true, "nb_filter": 2048, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [2, 2], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_40", 0, 0]]]}, {"name": "bn5a_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5a_branch2c", 0, 0]]]}, {"name": "bn5a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5a_branch1", 0, 0]]]}, {"name": "merge_14", "class_name": "Merge", "config": {"name": "merge_14", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["bn5a_branch2c", 0, 0], ["bn5a_branch1", 0, 0]]]}, {"name": "activation_43", "class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["merge_14", 0, 0]]]}, {"name": "res5b_branch2a", "class_name": "Convolution2D", "config": {"name": "res5b_branch2a", "trainable": true, "nb_filter": 512, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_43", 0, 0]]]}, {"name": "bn5b_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn5b_branch2a", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5b_branch2a", 0, 0]]]}, {"name": "activation_44", "class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5b_branch2a", 0, 0]]]}, {"name": "res5b_branch2b", "class_name": "Convolution2D", "config": {"name": "res5b_branch2b", "trainable": true, "nb_filter": 512, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_44", 0, 0]]]}, {"name": "bn5b_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn5b_branch2b", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5b_branch2b", 0, 0]]]}, {"name": "activation_45", "class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["bn5b_branch2b", 0, 0]]]}, {"name": "res5b_branch2c", "class_name": "Convolution2D", "config": {"name": "res5b_branch2c", "trainable": true, "nb_filter": 2048, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "linear", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}, "inbound_nodes": [[["activation_45", 0, 0]]]}, {"name": "bn5b_branch2c", "class_name": "BatchNormalization", "config": {"name": "bn5b_branch2c", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 3, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["res5b_branch2c", 0, 0]]]}, {"name": "merge_15", "class_name": "Merge", "config": {"name": "merge_15", "mode": "sum", "mode_type": 